[
  {
    "title": "Business Writing 1 Day Training in Edmonton",
    "event_url": "https://www.eventbrite.sg/e/business-writing-1-day-training-in-edmonton-tickets-772824929167?aff=ebdssbdestsearch",
    "date": null,
    "time": null,
    "location": "PH: +1 469 666 9332",
    "description": "Our classroom  and corporate training provides you the opportunity to interact with instructors and benefit from face-to-face instruction.Certificate: Course Completion CertificateLanguage: EnglishDuration: 1 DayCredits: 8Course Delivery: ClassroomRefreshments: Snacks, Beverages and Lunch included in a classroom sessionCourse Overview:Writing is a key method of communication for most people, and it\"s one that many people struggle with. Writing and communication skills have degraded with more and more people communicating through email and text messaging. Developing writing skills is still important in the business world as creating proper documents (such as proposals, reports, and agendas), giving you that extra edge in the workplace.The Business Writing workshop will give your participants a refresher on basic writing concepts (such as spelling, grammar, and punctuation), and an overview of the most common business documents. These basic skills will provide your participants with that extra benefit in the business world that a lot of people are losing.Learning Objectives:After completing this course, delegates will be able to:Write business documents to a professional standard and conforming to acceptable formatsPresent information in an organised, structured way so as to achieve a specific objectiveUse a business-like style and vocabulary, while displaying sensitivity to different levels of reader expertiseExpress ideas with confidence and clarity, supporting persuasive and logical argumentsAgenda:Module One: Working with WordsSpellingGrammarCreating a Cheat SheetModule Two: Constructing SentencesParts of a SentencePunctuationTypes of SentencesModule Three: Creating ParagraphsThe Basic PartsOrganization MethodsModule Four: Writing Meeting AgendasThe Basic StructureChoosing a FormatWriting the AgendaModule Five: Writing EmailsAddressing Your MessageGrammar and AcronymsModule Six: Writing Business LettersThe Basic StructureChoosing a FormatWriting the LetterModule Seven: Writing ProposalsThe Basic StructureChoosing a FormatWriting the ProposalModule Eight: Writing ReportsThe Basic StructureChoosing a FormatWriting the ReportModule Nine: Other Types of DocumentsRequests for ProposalsProjectionsExecutive SummariesBusiness CasesModule Ten: Proofreading and FinishingA Proofreading PrimerHow Peer Review Can HelpPrinting and PublishingModule Eleven: Wrapping UpWords from the WiseReview of Parking LotLessons LearnedCompletion of Action Plans and EvaluationsPrerequisites:There are no formal prerequisites.Course Materials:Students will receive a course manual with presentation slides and reference materials.Technical Requirements:For eBooks:Internet for downloading the eBookLaptop, tablet, Smartphone, eReader (No Kindle)Adobe DRM supported software (e.g. Digital Editions, Bluefire Reader)eBook download and activation instructions©️ 2025 Mangates Tech Solutions Pvt Ltd. This content is protected by copyright law. Copy, Reproduction or distribution without permission is prohibited.Public Speaking Training: According to a 1973 survey by the Sunday Times of London, 41% of people list public speaking as their biggest fear. Forget small spaces, darkness, and spiders, standing up in front of a crowd and talking is far more terrifying for most people. Through this workshop your participants will become more confident and relaxed in front of an audience which will translate into a successful speaking event.Leading Effective Teams Training: This training based on leading teams will help you to develop anyone that leads a team or is involved in a leadership role. It is also useful for those that are about to embark on a position of leadership or need to develop their leadership skills.Train the Trainer Training: Whether you are preparing to be a professional trainer, or you are someone who does a bit of training as a part of their job, you always want to be prepared. Your participants will understand that training is a process where skills, knowledge, and attitudes are applied in a unique way.Presentation Skills Training: In a survey carried out amongst experienced, middle and senior executives, designed to determine the things that they feared most, public speaking came out as number one. Death was eighth on the list! So, most of us would rather die than stand up and present!Practical Sales Skills Training: These practical sales skills training has been developed for salespeople or people who are required to sell as part of their role. This course is applicable for both people relatively new to sales as well as those who have a lot of experience as the content is flexible enough to adapt to suit the audience.Conflict Management Training: Disagreements, differences of opinion and conflicting perspectives on key issues inevitably arise in any context where people are working together.Research has shown that workplace conflicts can become highly destructive. Negative emotions may be stirred up, poisoning team morale, creating stress and destroying relationships.Power Query and Power Pivot for Excel Training: Power BI (including Power Query & Power Pivot) are the biggest Excel news items in the last 10 years. They give Excel users the power to draw information out of multiple sources, link it together then perform calculations on it that can then be sliced & diced any way you want.Essential Management Skills Training: Every day, managers solve difficult problems, turn organisations around, and achieve astonishing performance. To be successful, every organisation needs good managers.Manager Management  Training: With this course, you will be able to provide the skills, guidance, and empowerment to your team of managers. They will then be better suited in leading and motivating their team and thus produce fantastic results. To be a successful manager means having a wide range of skills. Through this workshop, you will be able to disperse your knowledge and experience throughout your leadership team.Sales Presentation Mastery Training: Sales are the absolute most essential component of any business, and selling skills are the most highly valued skills in today’s business landscape. The world's fastest growing and most successful businesses have one thing in common: they have effective sales people that drive their business forward.Time Management Training: Personal time management skills are essential for professional success in any workplace. Those able to successfully implement time management strategies are able to control their workload rather than spend each day in a frenzy of activity reacting to crisis after crisis - stress declines and personal productivity soars! These highly effective individuals are able to focus on the tasks with the greatest impact to them and their organization.Internet Marketing Fundamentals Training: Marketing has changed dramatically over the last decade. Marketing is all about communicating, and the Internet has completely changed the way people communicate. The Internet is a marketer's dream come true, especially with social media, as you have a low-cost marketing tool that can reach a large audience."
  },
  {
    "title": "Manager Management 1 Day Training in Edmonton",
    "event_url": "https://www.eventbrite.sg/e/manager-management-1-day-training-in-edmonton-tickets-772049128727?aff=ebdssbdestsearch",
    "date": null,
    "time": null,
    "location": "PH: +1 469 666 9332",
    "description": "Our classroom  and corporate training provides you the opportunity to interact with instructors and benefit from face-to-face instruction.Certificate: Course Completion CertificateLanguage: EnglishDuration: 1 DayCredits: 8Course Delivery: ClassroomRefreshments: Snacks, Beverages and Lunch included in a classroom sessionCourse Overview:With this course, you will be able to provide the skills, guidance, and empowerment to your team of managers. They will then be better suited in leading and motivating their team and thus produce fantastic results. To be a successful manager means having a wide range of skills. Through this workshop, you will be able to disperse your knowledge and experience throughout your leadership team.Manager Management takes a special type of leader. This workshop will expand your participant's knowledge and provide a way for them to teach and lead new and experienced managers. As every manager knows that learning never stops, this workshop will have something for everyone.Learning Objectives:By the end of this course you will be able to:Identify, relate to, and put into practice the four characteristics of highly effective managers.Plan, prioritise and delegate effectively.Understand how to manage performance in such a way as to get the very best from your people.Use a range of strategies for managing and developing a highly motivated and effective team.Recognise the need for change in today’s business reality and be able to manage change.Engaging and understanding others using a range of techniques.Agenda:Module One: Grooming a New ManagerSet Specific GoalsAuthority (What They Can and Can\"t Do)Create a Shared VisionThe More they Learn, the More Responsibility They GetCase StudyModule One: Review QuestionsModule Two: Measuring PerformanceStaying Within Their BudgetSetting Measurable ObjectivesSkip Level FeedbackCollaborate on Criteria to be EvaluatedCase StudyModule Two: Review QuestionsModule Three: Motivating ManagersProvide the Needed ResourcesBonuses and IncentivesGive Credit for Good WorkKeep Them ChallengedCase StudyModule Three: Review QuestionsModule Four: Signs of Poor ManagementMissed DeadlinesTeam TurnoverLosing CustomersLittle or No GrowthCase StudyModule Four: Review QuestionsModule Five: Trust Your Team of ManagersDo Not MicromanagePromote Open and Honest CommunicationReward InitiativeTrust, But VerifyCase StudyModule Five: Review QuestionsModule Six: When an Employee Complains about their ManagerKeep the Information ConfidentialGather Information from Both SidesCoach or Delegate the SolutionFollow-up with the Manager or EmployeeCase StudyModule Six: Review QuestionsModule Seven: Coaching and Mentoring (I)Writing Performance ReviewsProvide Clear and Timely FeedbackPraise in Public, Criticize in PrivateMake Sure Your Door is Always OpenCase StudyModule Seven: Review QuestionsModule Eight: Coaching and Mentoring (II)Offer Advice, Not the SolutionCreate a Supportive EnvironmentBuilding Ownership360 Degree FeedbackCase StudyModule Eight: Review QuestionsModule Nine: When Do You Step In?Unsafe or Dangerous EventsLegal RamificationsSevere Financial CostsRepeated Failures after Coaching Has OccurredCase StudyModule Nine: Review QuestionsModule Ten: Remember These Basic QualitiesExpress Confidence in Their AbilitiesPractice What you PreachHave an Open DoorTheir Success is Your SuccessCase StudyModule Ten: Review QuestionsModule Eleven: Wrapping UpWords from the WiseReview of Parking LotLessons LearnedCompletion of Action Plans and EvaluationsPrerequisites:NoneCourse Materials:Attendees will receive a course manual with presentation slides and reference materials.Technical Requirements:For eBooks:Internet for downloading the eBookLaptop, tablet, Smartphone, eReader (No Kindle)Adobe DRM supported software (e.g. Digital Editions, Bluefire Reader)eBook download and activation instructions©️ 2025 Mangates Tech Solutions Pvt Ltd. This content is protected by copyright law. Copy, Reproduction or distribution without permission is prohibited.Public Speaking Training: According to a 1973 survey by the Sunday Times of London, 41% of people list public speaking as their biggest fear. Forget small spaces, darkness, and spiders, standing up in front of a crowd and talking is far more terrifying for most people. Through this workshop your participants will become more confident and relaxed in front of an audience which will translate into a successful speaking event.Leading Effective Teams Training: This training based on leading teams will help you to develop anyone that leads a team or is involved in a leadership role. It is also useful for those that are about to embark on a position of leadership or need to develop their leadership skills.Train the Trainer Training: Whether you are preparing to be a professional trainer, or you are someone who does a bit of training as a part of their job, you always want to be prepared. Your participants will understand that training is a process where skills, knowledge, and attitudes are applied in a unique way.Presentation Skills Training: In a survey carried out amongst experienced, middle and senior executives, designed to determine the things that they feared most, public speaking came out as number one. Death was eighth on the list! So, most of us would rather die than stand up and present!Practical Sales Skills Training: These practical sales skills training has been developed for salespeople or people who are required to sell as part of their role. This course is applicable for both people relatively new to sales as well as those who have a lot of experience as the content is flexible enough to adapt to suit the audience.Conflict Management Training: Disagreements, differences of opinion and conflicting perspectives on key issues inevitably arise in any context where people are working together.Research has shown that workplace conflicts can become highly destructive. Negative emotions may be stirred up, poisoning team morale, creating stress and destroying relationships.Power Query and Power Pivot for Excel Training: Power BI (including Power Query & Power Pivot) are the biggest Excel news items in the last 10 years. They give Excel users the power to draw information out of multiple sources, link it together then perform calculations on it that can then be sliced & diced any way you want.Essential Management Skills Training: Every day, managers solve difficult problems, turn organisations around, and achieve astonishing performance. To be successful, every organisation needs good managers.Manager Management  Training: With this course, you will be able to provide the skills, guidance, and empowerment to your team of managers. They will then be better suited in leading and motivating their team and thus produce fantastic results. To be a successful manager means having a wide range of skills. Through this workshop, you will be able to disperse your knowledge and experience throughout your leadership team.Sales Presentation Mastery Training: Sales are the absolute most essential component of any business, and selling skills are the most highly valued skills in today’s business landscape. The world's fastest growing and most successful businesses have one thing in common: they have effective sales people that drive their business forward.Time Management Training: Personal time management skills are essential for professional success in any workplace. Those able to successfully implement time management strategies are able to control their workload rather than spend each day in a frenzy of activity reacting to crisis after crisis - stress declines and personal productivity soars! These highly effective individuals are able to focus on the tasks with the greatest impact to them and their organization.Internet Marketing Fundamentals Training: Marketing has changed dramatically over the last decade. Marketing is all about communicating, and the Internet has completely changed the way people communicate. The Internet is a marketer's dream come true, especially with social media, as you have a low-cost marketing tool that can reach a large audience."
  },
  {
    "title": "Stakeholder Management 1 Day Training in Edmonton",
    "event_url": "https://www.eventbrite.sg/e/stakeholder-management-1-day-training-in-edmonton-tickets-770794285457?aff=ebdssbdestsearch",
    "date": null,
    "time": null,
    "location": "PH: +1 469 666 9332",
    "description": "Our classroom  and corporate training provides you the opportunity to interact with instructors and benefit from face-to-face instruction.Certificate: Course Completion CertificateLanguage: EnglishDuration: 1 DayCredits: 8Course Delivery: ClassroomRefreshments: Snacks, Beverages and Lunch included in a classroom sessionCourse Overview:Anyone in a leadership role or heading up a project that has to engage, persuade and influence others would benefit from these training course materials on Stakeholder Management.Course Contents:A stakeholder can be defined, in simple terms, as any person or organization whose behavior's or actions will have an impact on a result.This training aims to help you identify your stakeholders; learn how to establish behavioral styles, understand the relationship between the style and their own and use this knowledge to build a strong working partnership that gets results.By following a logical progression, through identification of stakeholders; initial contact; mapping of aims and ongoing planning, increased positive results can be achieved.The early identification of the key influencers will ensure that projects are well managed from the start. Communication can be effectively tailored to the right people so as to guarantee an easier flow of information and quicker decision making. In the longer term, projects will require less micro-management as all involved will have a clear understanding of progress and goals.Course Topics:Using proven techniques and methods, this stakeholder management training will teach a full process for the best possible management of key Stakeholders:Stakeholders AnalysisTo get the best out of stakeholders it must be fully understood how they will fit into a project. Stakeholder analysis is a method of breaking down the full picture so as to identify and understand the key players.Understanding Stakeholder Behaviors StylesOnce Stakeholders have been identified, and prioritized, we need to look at how our own behavioral style interacts with theirs. What style are you?Identifying Stakeholder NeedsOnce stakeholders have been identified and we have examined how behavioral styles interact, the next step is to look at how to work best with each one.Securing Stakeholder AgreementOnce initial meetings have taken place, and ideas have been discussed, a progression plan can be created. The vital point of any on-going plan is to gain the agreement of all key Stakeholders, without which the project stalls.On-going Stakeholder ManagementThe long-term success of your project will be reliant on the long-term contentment and involvement of your stakeholdersCourse Feature:At the end of this stakeholder management training, you will be able to:Identify your style of stakeholder management along with the needs of yourRecognize ways of securing stakeholder agreement.Distinguish the 6 different persuasion styles.State various methods to build an on-going relationship.Leave with a detailed understanding of each of the subjects covered along with a development action plan.Certification:Once after the training you receive course completion certificate from Mangates.Who can Attend?Anybody who is interested in learning Stakeholder Management Skills.©️ 2025 Mangates Tech Solutions Pvt Ltd. This content is protected by copyright law. Copy, Reproduction or distribution without permission is prohibited.Public Speaking Training: According to a 1973 survey by the Sunday Times of London, 41% of people list public speaking as their biggest fear. Forget small spaces, darkness, and spiders, standing up in front of a crowd and talking is far more terrifying for most people. Through this workshop your participants will become more confident and relaxed in front of an audience which will translate into a successful speaking event.Leading Effective Teams Training: This training based on leading teams will help you to develop anyone that leads a team or is involved in a leadership role. It is also useful for those that are about to embark on a position of leadership or need to develop their leadership skills.Train the Trainer Training: Whether you are preparing to be a professional trainer, or you are someone who does a bit of training as a part of their job, you always want to be prepared. Your participants will understand that training is a process where skills, knowledge, and attitudes are applied in a unique way.Presentation Skills Training: In a survey carried out amongst experienced, middle and senior executives, designed to determine the things that they feared most, public speaking came out as number one. Death was eighth on the list! So, most of us would rather die than stand up and present!Practical Sales Skills Training: These practical sales skills training has been developed for salespeople or people who are required to sell as part of their role. This course is applicable for both people relatively new to sales as well as those who have a lot of experience as the content is flexible enough to adapt to suit the audience.Conflict Management Training: Disagreements, differences of opinion and conflicting perspectives on key issues inevitably arise in any context where people are working together.Research has shown that workplace conflicts can become highly destructive. Negative emotions may be stirred up, poisoning team morale, creating stress and destroying relationships.Power Query and Power Pivot for Excel Training: Power BI (including Power Query & Power Pivot) are the biggest Excel news items in the last 10 years. They give Excel users the power to draw information out of multiple sources, link it together then perform calculations on it that can then be sliced & diced any way you want.Essential Management Skills Training: Every day, managers solve difficult problems, turn organisations around, and achieve astonishing performance. To be successful, every organisation needs good managers.Manager Management  Training: With this course, you will be able to provide the skills, guidance, and empowerment to your team of managers. They will then be better suited in leading and motivating their team and thus produce fantastic results. To be a successful manager means having a wide range of skills. Through this workshop, you will be able to disperse your knowledge and experience throughout your leadership team.Sales Presentation Mastery Training: Sales are the absolute most essential component of any business, and selling skills are the most highly valued skills in today’s business landscape. The world's fastest growing and most successful businesses have one thing in common: they have effective sales people that drive their business forward.Time Management Training: Personal time management skills are essential for professional success in any workplace. Those able to successfully implement time management strategies are able to control their workload rather than spend each day in a frenzy of activity reacting to crisis after crisis - stress declines and personal productivity soars! These highly effective individuals are able to focus on the tasks with the greatest impact to them and their organization.Internet Marketing Fundamentals Training: Marketing has changed dramatically over the last decade. Marketing is all about communicating, and the Internet has completely changed the way people communicate. The Internet is a marketer's dream come true, especially with social media, as you have a low-cost marketing tool that can reach a large audience."
  },
  {
    "title": "Customer Service Essentials 1 Day Training in Edmonton",
    "event_url": "https://www.eventbrite.sg/e/customer-service-essentials-1-day-training-in-edmonton-tickets-769711647257?aff=ebdssbdestsearch",
    "date": null,
    "time": null,
    "location": "PH: +1 469 666 9332",
    "description": "Our classroom  and corporate training provides you the opportunity to interact with instructors and benefit from face-to-face instruction."
  },
  {
    "title": "Lean Six Sigma Green Belt Confirmed Calgary In-person Training",
    "event_url": "https://www.eventbrite.com/e/lean-six-sigma-green-belt-confirmed-calgary-in-person-training-tickets-1497618249499?aff=ebdssbdestsearch",
    "date": null,
    "time": null,
    "location": "First Edmonton Place, 10665 Jasper Ave 14th Floor",
    "description": "Confirmed Lean Six Sigma Green black In-person training every week by Master Black Belt instructors with exam voucher & pass guaranteeLean Six Sigma Green Belt (LSSGB) Certification Training4-Day Instructor-Led Bootcamp | In-Person ClassroomHosted by Certification Planner, LLC📍 Note: Eventbrite may list this as a one-day event. This is a comprehensive 4-day training conducted Monday–Thursday or Tuesday–Friday.🎯 Certification Overview – Why LSSGB?The Lean Six Sigma Green Belt (LSSGB) certification is a globally respected credential designed for professionals seeking to improve quality, reduce inefficiencies, and lead process improvement initiatives.Certified Green Belts play a crucial role in Six Sigma projects by managing small to mid-scale initiatives and contributing to larger Black Belt-led projects. They apply data-driven techniques and Lean principles to streamline processes and deliver measurable results across industries.Whether you're in manufacturing, healthcare, IT, finance, or public service, LSSGB helps you:Improve operational performanceEnhance customer satisfactionAdvance into leadership rolesDeliver cost savings and efficiency gains🎓 About Certification Planner’s LSSGB Training Program:Certification Planner’s 4-day LSSGB bootcamp offers a robust, hands-on learning experience combining theoretical knowledge and practical tools. Our program prepares professionals for immediate workplace application and Green Belt exam success.Why Certification Planner?✔️ 100% Pass Guarantee – You pass or we re-train at no cost✔️ Real-world case studies and examples✔️ Certified and experienced Lean Six Sigma instructors✔️ Trusted by 1000s of professionals and Fortune 500 organizations✔️ 35 PDUs included – PMI credential holders welcome✔️ Guaranteed-to-run classes in 120+ cities and online📦 What’s Included in the LSSGB Course?✅ 4 Days of Intensive In-Person Training✅ Customized Green Belt Study Guide & Workbook✅ Practice Exams Aligned with the Certification Format✅ Open-Book Online Exam Voucher (Valid for 1 Year)✅ Earn 35 PDUs + Certificate of Completion✅ 100% Exam Pass Guarantee✅ 6 Months Post-Class Q&A Support✅ Access to Templates, Tools & Case Studies📞 Need Help?Group/Corporate: Daniel@certificationplanner.comGeneral Support: Jacob@certificationplanner.comLive Chat with Us Now: Click HereVisit Us: www.certificationplanner.com🗓️ Sample Course Agenda – Lean Six Sigma Green BeltDay 1:Introduction to Lean & Six SigmaDMAIC Framework OverviewRoles, Responsibilities & Belt HierarchyDefine Phase: Project Charter, Problem/Goal Statement, VOC, SIPOCDay 2:Measure Phase: Process Mapping, Data Types, Basic StatisticsMeasurement Systems Analysis (MSA)Control Charts & Capability AnalysisDay 3:Analyze Phase: Root Cause Tools (5 Whys, Fishbone)Graphical Analysis (Box Plot, Histogram, Pareto)Hypothesis Testing OverviewLean Tools: 5S, Kaizen, Poka-Yoke, KanbanDay 4:Improve Phase: Brainstorming, DOE Basics, Pilot TestingControl Phase: Control Plans, Sustaining ImprovementsPractice Exam, Final Review & Exam Walkthrough📝 Exam Details:Mode: Online (Open Book)Validity: 1 YearFormat: 100 Multiple Choice QuestionsDuration: 3 HoursAttempts: 3 within 7 DaysPassing Score: 65%Certificate: Lean Six Sigma Green Belt + 35 PDUs📢 Why Choose Us?⭐ Expert Instructors: Certified Lean Six Sigma professionals with real-world expertise🎯 Practical Focus: Apply Lean tools to real business problems🧠 Interactive Format: Group exercises, role play, peer learning📚 Comprehensive Materials: Study guides, practice tests, templates, and tools📍 Upcoming LSSGB Bootcamp Locations:We run weekday and weekend Green Belt courses every week across 120+ cities and live online.➡️ Visit organizer profile to view schedule or explore www.certificationplanner.com💼 Corporate or Group Training?Have a team of 3 or more? Get customized private training (onsite or online) for your organization.Contact: Daniel@certificationplanner.comGroup discounts up to 50% available!🔗 Also Explore Training In:PMP | CAPM | PMI-ACP | CISSP | CISA | Salesforce Admin | ITIL 4 | PgMP | LSS Black Belt | LSS Master Black Belt🏷️ Tags:#LSSGB #LeanSixSigmaGreenBelt #SixSigmaTraining #ProcessImprovement #DMAIC #QualityManagement #LeanTools #GreenBeltBootcamp #LSSGBTraining #CertificationPlanner"
  },
  {
    "title": "PMI PMP® Certification Training Course – 4-Day Calgary Bootcamp",
    "event_url": "https://www.eventbrite.com/e/pmi-pmp-certification-training-course-4-day-calgary-bootcamp-tickets-1417679109379?aff=ebdssbdestsearch",
    "date": null,
    "time": null,
    "location": "First Edmonton Place, 10665 Jasper Ave 14th Floor",
    "description": "PMP exam preparation bootcamp with 100% pass assurance and guaranteed to run by certified instructors.PMI PMP® Certification Training Course – 4-Day Instructor-Led BootcampHosted by Certification Planner, LLCNote: Eventbrite may display only the first day. This is a 4-day live instructor-led program conducted from Monday to Thursday or Tuesday to Friday.Welcome to our PMP® Exam Preparation Bootcamp – a program carefully designed and developed by PMI®-certified instructors to equip you with the knowledge, tools, and confidence needed to pass the globally recognized PMP certification exam. Our expert instructors bring over 15 years of real-world project management experience and hold multiple industry certifications, ensuring that each session delivers practical insights aligned with PMI’s exam content.Support doesn’t end when the class does – we continue to assist you with post-bootcamp exam prep guidance to help you stay on track.With our 100% pass guarantee, your investment is protected – you pass, we pass; you fail, we fail. Certification Planner proudly maintains a 98.23% success rate in PMP certification, standing out in the industry by focusing on skill-building, not just memorization.Explore what’s included, compare packages, check out the FAQ section, and view upcoming schedules below to get started on your journey to becoming a certified PMP professional.Questions?Group Training / Custom Discounts: Daniel@certificationplanner.comCourse Schedule & Support: Jacob@certificationplanner.comLive Chat Now: Click HereWhy Train with Certification Planner?Certification Planner has empowered thousands of professionals to achieve PMP certification with confidence. We offer instructor-led training in 120+ cities every month, backed by a 100% pass guarantee and the highest success rate in the industry.By enrolling in our program, you’ll receive personalized support, official materials, real-world insights, and tools to master the exam – even if you're new to formal project management.✅ What’s Included in the 4-Day PMP® Training4 Full Days of Instructor-Led TrainingPMI-Approved Course MaterialsPMBOK® Guide 7th Ed. + Agile Practice GuidePractice Exams & Quizzes to test your knowledgeLive Training by PMI-Certified InstructorsPMI Application Assistance35 Contact Hours/PDUs Certificate (PMI requirement)100% Exam Pass GuaranteeGuaranteed-to-Run Classes – no last-minute cancellationsCourse Packages: (Select at Checkout)PMP Regular Course: $1799 (Includes Everything Mentioned Above)PMP Plus Course: $2499 (Includes Regular Course + PMP Exam Fee + PMI Membership)Corporate or Group Training AvailableAre you enrolling as a team?We offer private, instructor-led corporate training for teams of 3 or more participants, either onsite or virtually.Group discounts of up to 50% are available.Contact Daniel@certificationplanner.com for a custom quote.Upcoming PMP Class ScheduleWe offer PMP Bootcamp every week in 120+ cities. You can find the class schedule on Eventbrite or at our official website www.certificationplanner.com. Registration will be closed 3 weeks prior to the class.Enroll now to secure your seat!PMP Course Agenda – Based on PMI’s Latest Exam Content Outline (ECO)Day 1: Introduction + Domain 1: PeopleBuild a High-Performing TeamDefine Team Ground RulesLead and Support Team PerformanceDay 2: Domain 2: ProcessExecute the Project with Quality and Risk in MindManage Communication, Procurement & ScopeIntegrate Planning, Scheduling & BudgetingDay 3: Domain 3: Business EnvironmentDeliver Business ValueEnsure Knowledge Transfer & ComplianceDay 4: Practice Exam, Application Review & Exam StrategyMock Test & ReviewExam-Taking TechniquesApplication Submission GuidanceReady to Get PMP Certified?Secure your seat on Eventbrite today for instant confirmation.Want to explore more schedules? Visit our organizer profileOther Courses We OfferCAPM | PMI-ACP | RMP | ITIL 4 Foundation | CISSP | CISA | Lean Six Sigma GB & BB | Salesforce Admin & BA | TOGAF | PgMP and more.Tags: #PMPCertification #ProjectManagementProfessional #PMPExamPreparation #PMPTraining #PMBOKGuide #PMPStudy #ProjectManagementSkills #PMPExamTips #PMPSucces #PMPExamResources"
  },
  {
    "title": "Lean Six Sigma Green & Black Belt Training with Exam Voucher in Calgary",
    "event_url": "https://www.eventbrite.com/e/lean-six-sigma-green-black-belt-training-with-exam-voucher-in-calgary-tickets-1393249399459?aff=ebdssbdestsearch",
    "date": null,
    "time": null,
    "location": "First Edmonton Place, 10665 Jasper Ave 14th Floor",
    "description": "Guarantee to run in-person Lean Six Sigma Green and Black Belt exam prep course with pass guarantee, certified instructors and exam voucher.Dual Lean Six Sigma Green & Black Belt Certification TrainingThis is a 4-day instructor-led training, held Tuesday through Friday or Monday to Thursday. Please note: Eventbrite only displays the first day due to platform limitations, but the course spans the full four days as detailed below.Certification OverviewLean Six Sigma blends Lean (waste reduction) and Six Sigma (quality improvement) to streamline operations and drive business excellence. Green and Black Belt certifications are ideal for professionals aiming to lead impactful improvement projects across various industries.Training OverviewCertification Planner’s Dual Green & Black Belt program delivers comprehensive, practical training on Lean Six Sigma principles. Learn from certified instructors, practice real-world scenarios, and prepare confidently for both exams — all in just 4 days.Registration & Support✔ Register on Eventbrite for instant confirmation📧 Group/Corporate Discounts: Daniel@certificationplanner.com📧 Course Queries: Jacob@certificationplanner.com💬 Need Help Fast? Chat NowCourse Highlights4 Days of In-Person Training (Weekday & Weekend Options)Certified, Experienced InstructorsCertified Course Materials100% Exam Pass GuaranteeNo Class Cancellations – Sessions Guaranteed to RunOpen Book Exam Voucher IncludedPost-Classroom Support & 3 Exam AttemptsEarn 60 PDUs (PMI Recognized)What You’ll Learn – 4-Day AgendaDay 1: Introduction, Define Phase & Voice of the CustomerDay 2: Measure Phase – Process Mapping, MSA & CapabilityDay 3: Analyze & Improve Phase – Root Cause, DOE & Lean ToolsDay 4: Control Phase, Exam Review & Q&AExam InformationFormat: 100 Multiple-Choice QuestionsTime: 3 HoursPass Score: 65%Mode: Open BookAttempts: Up to 3Access: 7 Days to Complete Exam OnlineSupport: Instructor-Led Q&A + Post-Class MentorshipWeekly Classes in 120+ CitiesIn-person or online — flexible scheduling available. (This is an in-person classroom training)Other Popular ProgramsPMP® | CAPM® | PMI-ACP® | ITIL® 4 | CISA® | CISSP® | Salesforce | TOGAF® | PgMP® and more!Tags:#LeanSixSigma #GreenBeltCertification #BlackBeltCertification #ContinuousImprovement #QualityManagement #ProcessImprovement #ProfessionalDevelopment #SixSigmaTraining"
  },
  {
    "title": "Six Sigma Black Belt Course with Exam Voucher Training in Calgary",
    "event_url": "https://www.eventbrite.com/e/six-sigma-black-belt-course-with-exam-voucher-training-in-calgary-tickets-1375071218029?aff=ebdssbdestsearch",
    "date": null,
    "time": null,
    "location": "First Edmonton Place, 10665 Jasper Ave 14th Floor",
    "description": "Guarantee to run in-person Lean Six Sigma Black Belt exam prep course with pass guarantee, certified instructors and exam voucher.Lean Six Sigma Black Belt (LSSBB) Certification Training Workshop4-Day Instructor-Led Course | In-Person | Held Tuesday–Friday or Monday–Thursday⚠️ Please note: Eventbrite displays only the first day of the course. This is a 4-day training program. See the agenda below for full schedule details.Unlock Your Leadership Potential with LSSBB CertificationJoin our immersive Lean Six Sigma Black Belt Certification Workshop—designed to elevate your problem-solving, leadership, and strategic thinking capabilities. Hosted by Certification Planner, this course empowers professionals to drive high-impact improvements across business operations.About the LSSBB CertificationThe Lean Six Sigma Black Belt Certification is a globally recognized credential that highlights your expertise in Lean principles, Six Sigma methodologies, and advanced analytical tools. Certified Black Belts are equipped to lead complex projects, reduce waste, and drive performance improvements across any industry.What to Expect from Our LSSBB TrainingLed by certified Master Black Belt instructors, this program blends intensive classroom training with practical case studies and real-world scenarios. You'll build deep expertise in Lean Six Sigma and graduate ready to lead organizational transformation.Registration & Support✔ Register on Eventbrite for instant confirmation📧 Group/Corporate Discounts: Daniel@certificationplanner.com📧 Course Questions: Jacob@certificationplanner.com💬 Need Help Fast? Chat NowCourse DetailsDuration: 4 days of instructor-led in-person classroom trainingInstructor: Certified Lean Six Sigma Master Black BeltMaterials: Customized LSSBB study guide, case studies, and practice testsExam Voucher: Open book, online exam with 1-year validity and up to 3 attemptsCertification: 60 PDUs + course completion certificateSupport: 6 months of post-classroom Q&A mentorshipPass Guarantee: 100% exam pass assuranceWhat You’ll Learn – 4-Day Training AgendaDay 1: Introduction, Define Phase, Voice of the CustomerDay 2: Measure Phase – Process Mapping, MSA, CapabilityDay 3: Analyze & Improve – Root Cause, DOE, Lean ToolsDay 4: Control Phase, Exam Review, Q&AExam InformationFormat: 100 multiple-choice questionsDuration: 3 hoursMode: Online, open bookPassing Score: 65%Exam Access: Complete within 7 days of activationRetakes: Up to 3 attempts includedPost-Exam Support: Instructor-led support & Q&AWho Should AttendThis workshop is ideal for:Quality managers, process improvement professionalsProject managers & business analystsOperational leaders & continuous improvement teamsProfessionals aiming to lead strategic change initiativesEligibility:Foundational understanding of Lean Six Sigma (Green Belt knowledge preferred)Experience managing or contributing to process improvement projectsStrong commitment to learning and applying Six Sigma toolsWhy Choose Certification Planner✅ Certified & experienced Master Black Belt instructors✅ Hands-on, real-world applications—not just theory✅ Interactive, discussion-driven learning environment✅ Access to premium study tools and post-class support✅ Flexible scheduling—classes in 120+ cities weeklyMore Courses OfferedPMP | CAPM | PgMP | RMP | CISSP | CISA | CISM | ITIL 4 | Salesforce Admin | Salesforce BA | Lean Six Sigma Green Belt | Black Belt | and more...Learn more:In-person or online | Classes available every week | Visit CertificationPlanner.comTags:#LeanSixSigma #BlackBeltCertification #SixSigmaTraining #ProcessImprovement #QualityManagement #LeadershipDevelopment #LSSBB #ProfessionalGrowth #ContinuousImprovement #StrategicLeadership"
  },
  {
    "title": "MADAME MATCH'S MIXER",
    "event_url": "https://www.eventbrite.com/e/madame-matchs-mixer-tickets-1974935226426?aff=ebdssbdestsearch",
    "date": "2025-12-10",
    "time": "Dec 10 from 7pm to 9:30pm MST",
    "location": "24 Boudreau Road",
    "description": "SPIN THE WHEEL FOR YOUR CHANCE AT LOVE!"
  },
  {
    "title": "Holiday Market at The Enjoy Center",
    "event_url": "https://www.eventbrite.ca/e/holiday-market-at-the-enjoy-center-tickets-1730785087789?aff=ebdssbdestsearch",
    "date": "2025-11-29",
    "time": "Nov 29 at 12pm to Nov 30 at 4pm MST",
    "location": "101 Riel Drive",
    "description": "Join us for a magical holiday market at The Enjoy Center.  Shop 70+ vendors, visit Santa Claus and cross off your holiday list!🎄 Hello Pretty Market: A Very Pretty Holiday 🎄📍 Location: The Enjoy Centre📅 Dates: November 29 & 30, 2025⏰ Time: 12 PM – 5 PM both daysStep into a festive wonderland at Hello Pretty Market: A Very Pretty Holiday — a joyful holiday market hosted at the beautiful Enjoy Centre!✨ Browse over 70 local vendors featuring handmade goods, unique gifts, seasonal treats, home décor, and so much more.🎅 Visit with Santa Claus and capture the magic of the season. Take your own free photos!☕ Warm up with festive holiday drinks as you shop and explore.🎁 Enjoy holiday music, cozy vibes, and plenty of photo-worthy moments.Whether you're kicking off your holiday shopping or looking for a festive day out, this is your must-visit market of the season!Admission: $5 online $7 at the door (plus taxes)Follow us for updates: @helloprettymarketwww.helloprettymarket.com"
  },
  {
    "title": "For The Love Of Travel! The YEG Travel Show Valentines Day",
    "event_url": "https://www.eventbrite.ca/e/for-the-love-of-travel-the-yeg-travel-show-valentines-day-tickets-1105020077799?aff=ebdssbdestsearch",
    "date": "2026-02-14",
    "time": "Feb 14 from 10am to 4pm MST",
    "location": "4404 Gateway Boulevard Northwest",
    "description": "Hey there! YEG TRAVEL SHOW is your one-stop shop for all things travel-related, featuring exciting destinations, expert tips, and more!Welcome to YEG TRAVEL SHOW!Date: February 14th, 2026 | Time: 10:00 AM – 4:00 PMLocation: Delta Hotels Edmonton South Conference CentreThis Valentine’s Day, celebrate your passion for adventure at the YEG TRAVEL SHOW with this year’s heartfelt theme: “For the Love of Travel.” Whether you’re planning a romantic getaway, a family vacation, or your next solo escape, this event is made for travel lovers like you.Spend the day surrounded by travel inspiration, expert advice, exclusive deals, and giveaways! Meet top travel suppliers from around the world, discover exciting new destinations, and attend live sessions covering the latest travel trends and insider tips.💘 Celebrate love, wanderlust, and the joy of exploring🚗 Enjoy Free Parking🎁 Get Access to Show-Day Only Specials & Exclusive Discount Codes💸 Early Bird 2 for 1 is on for a limited time!Bring your partner, your besties, or fly solo—and fall in love with the world again at the YEG TRAVEL SHOW!"
  },
  {
    "title": "Holiday Ceramic Gnome Cookie Jar Making Workshop| No Experience Needed",
    "event_url": "https://www.eventbrite.ca/e/holiday-ceramic-gnome-cookie-jar-making-workshop-no-experience-needed-tickets-1971486483142?aff=ebdssbdestsearch",
    "date": null,
    "time": null,
    "location": "10137 104 Street Northwest",
    "description": "Love gnomes? Love cookies? Love making art? (Honestly, who doesn't!) Now you can make your very own gnome - and yes, they're cookie jars!Welcome to Stephanie Jonsson Creative's Gnome Cookie Jar Workshop!I'm a professional artist who has been teaching for over 20 years, every level from 4 years old to post secondary students and seniors. I truly love ceramics and want everyone to discover the joy of ceramics for themselves. ✨Come discover what clay is all about with me!Looking for a fun, creative, holiday-themed night out in Edmonton? Book yourself (and a friend) a spot in this incredible workshop! This workshop price includes four hours of instruction, materials, and all firings (bisque and glaze). Bookings are limited - only 6 people for each of these intimate workshops - perfect for a unique Christmas party or holiday get together!In this beginner-friendly, hands-on workshop, you’ll create your very own ceramic gnome cookie jar. You can choose how you personalize your gnome - add a witch hat, a cookie in their hand, a candy cane, or personalize by adding you own name!Please note: There are two parts to this workshop. The workshop session you are signing up for (4 hours) is the building session where you work with wet clay. You will need to sign up for a second session when you glaze (paint the colour on the gnome cookie jar) at your leisure. The cost includes both session 1 and 2. The second session should be scheduled within 2 weeks later and should take between 1.5 - 3 hours. You can preview the glazing schedule  here.📍 Location: 10137 104 Street NW — a cozy, inspiring space to unleash your creativity👥 Small group, all materials included🎉 Create with mud, relax, and discover the joy of making something with your own hands!*depending on your workshop date, we cannot guarantee delivery before Christmas"
  }
]